app/controllers/admin/genres_controller.rb

  def index
    @genres = Genre.all.page(params[:page]).per(7).order("created_at DESC")
---
SELECT  "genres".* FROM "genres" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]

  def create
    @genre = Genre.new(genre_params)
  if @genre.save
    redirect_to admin_genres_path, notice: 'You have created genre successfully.'
  else
    @genres = Genre.all.page(params[:page]).per(7).order("created_at DESC")
---
INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "焼き菓子"], ["created_at", "2021-06-27 09:59:10.430987"], ["updated_at", "2021-06-27 09:59:10.430987"]]
SELECT  "genres".* FROM "genres" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 7], ["OFFSET", 0]]