app/controllers/admin/orders_controller.rb

  def top
    @orders = Order.all.page(params[:page]).per(10)
---
SELECT  "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]