app/controllers/admin/products_controller.rb

  def index
    # @products = Product.page(params[:page]).reverse_order
    @products = Product.all.page(params[:page]).per(10)
---
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def new
    @product = Product.new
    @genres = Genre.all
---
SELECT "genres".* FROM "genres"

  def create
    @product = Product.new(product_params)
    if @product.save
      redirect_to admin_product_path(@product), notice: 'You have created product successfully.'
    else
<<<<<<< HEAD
      @products = Product.all
      render 'index'
=======
      @product = Product.new
      @genres = Genre.all
---
SELECT "genres".* FROM "genres"