app/controllers/public/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."created_at" ASC
---
  def top
    @products = Product.all.order(created_at: :asc) #:asc,古い順